[
  {
    "arabic": "يَدْعُونَ فِيهَا بِكُلِّ فَاكِهَةٍ آمِنِينَ",
    "urdu": "وہ ہر قسم کے پھلوں کو بلا خوف و خطر طلب کریں گے۔",
    "english": "They will call therein for every kind of fruit, secure from all harm.",
    "reference": "Surah Ad-Dukhan 44:55"
  },
  {
    "arabic": "وَإِن تَعُدُّوا نِعْمَتَ اللَّهِ لَا تُحْصُوهَا",
    "urdu": "اور اگر تم اللہ کی نعمتوں کو گننا چاہو تو ان کا شمار نہیں کر سکتے۔",
    "english": "And if you should count the favors of Allah, you could not enumerate them.",
    "reference": "Surah Ibrahim 14:34"
  },
  {
    "arabic": "إِنَّ مَعَ الْعُسْرِ يُسْرًا",
    "urdu": "بے شک مشکل کے ساتھ آسانی ہے۔",
    "english": "Indeed, with hardship comes ease.",
    "reference": "Surah Ash-Sharh 94:5"
  },
  {
    "arabic": "وَمَن يَتَّقِ اللَّهَ يَجْعَل لَّهُ مَخْرَجًا",
    "urdu": "اور جو اللہ سے ڈرتا ہے، اللہ اس کے لیے نکلنے کی راہ پیدا کر دیتا ہے۔",
    "english": "And whoever fears Allah - He will make for him a way out.",
    "reference": "Surah At-Talaq 65:2"
  },
  {
    "arabic": "فَإِنَّ مَعَ الْعُسْرِ يُسْرًا إِنَّ مَعَ الْعُسْرِ يُسْرًا",
    "urdu": "پس یقیناً دشواری کے ساتھ آسانی ہے، یقیناً دشواری کے ساتھ آسانی ہے۔",
    "english": "For indeed, with hardship comes ease. Indeed, with hardship comes ease.",
    "reference": "Surah Ash-Sharh 94:5-6"
  },
  {
    "arabic": "وَلَا تَيْأَسُوا مِن رَّوْحِ اللَّهِ",
    "urdu": "اور اللہ کی رحمت سے مایوس نہ ہو۔",
    "english": "And despair not of relief from Allah.",
    "reference": "Surah Yusuf 12:87"
  },
  {
    "arabic": "وَمَن يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ",
    "urdu": "اور جو اللہ پر بھروسہ رکھتا ہے تو وہ اس کے لیے کافی ہے۔",
    "english": "And whoever relies upon Allah - then He is sufficient for him.",
    "reference": "Surah At-Talaq 65:3"
  },
  {
    "arabic": "إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
    "urdu": "بے شک اللہ صبر کرنے والوں کے ساتھ ہے۔",
    "english": "Indeed, Allah is with the patient.",
    "reference": "Surah Al-Baqarah 2:153"
  },
  {
    "arabic": "وَلَنَبْلُوَنَّكُمْ بِشَيْءٍ مِّنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِّنَ الْأَمْوَالِ وَالْأَنفُسِ وَالثَّمَرَاتِ وَبَشِّرِ الصَّابِرِينَ",
    "urdu": "اور ہم ضرور تمہیں آزمائیں گے کچھ خوف اور بھوک اور مالوں اور جانوں اور پھلوں کی کمی سے، اور صبر کرنے والوں کو خوشخبری سنا دو۔",
    "english": "And We will surely test you with something of fear and hunger and a loss of wealth and lives and fruits, but give good tidings to the patient.",
    "reference": "Surah Al-Baqarah 2:155"
  },
  {
    "arabic": "وَلَا تَقُولُوا لِمَنْ يُقْتَلُ فِي سَبِيلِ اللَّهِ أَمْوَاتٌ بَلْ أَحْيَاءٌ وَلَٰكِنْ لَا تَشْعُرُونَ",
    "urdu": "اور جو اللہ کی راہ میں مارے جائیں انہیں مردہ مت کہو بلکہ وہ زندہ ہیں لیکن تمہیں شعور نہیں۔",
    "english": "And do not say about those who are killed in the way of Allah, 'They are dead.' Rather, they are alive, but you perceive it not.",
    "reference": "Surah Al-Baqarah 2:154"
  },
  {
    "arabic": "وَاسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى الْخَاشِعِينَ",
    "urdu": "اور صبر اور نماز کے ذریعے مدد چاہو، اور یہ بڑی بھاری چیز ہے مگر عاجزی کرنے والوں پر نہیں۔",
    "english": "And seek help through patience and prayer, and indeed, it is difficult except for the humbly submissive.",
    "reference": "Surah Al-Baqarah 2:45"
  },
  {
    "arabic": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
    "urdu": "اے ہمارے رب! ہمیں دنیا میں بھلائی دے اور آخرت میں بھی بھلائی دے اور ہمیں آگ کے عذاب سے بچا۔",
    "english": "Our Lord, give us in this world good and in the Hereafter good and protect us from the punishment of the Fire.",
    "reference": "Surah Al-Baqarah 2:201"
  },
  {
    "arabic": "إِنَّ اللَّهَ لَا يُغَيِّرُ مَا بِقَوْمٍ حَتَّىٰ يُغَيِّرُوا مَا بِأَنْفُسِهِمْ",
    "urdu": "بے شک اللہ کسی قوم کی حالت نہیں بدلتا جب تک وہ خود اپنی حالت نہ بدلے۔",
    "english": "Indeed, Allah will not change the condition of a people until they change what is in themselves.",
    "reference": "Surah Ar-Ra'd 13:11"
  },
  {
    "arabic": "وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِّلْعَالَمِينَ",
    "urdu": "اور ہم نے آپ کو نہیں بھیجا مگر تمام جہانوں کے لیے رحمت بنا کر۔",
    "english": "And We have not sent you except as a mercy to the worlds.",
    "reference": "Surah Al-Anbiya 21:107"
  },
  {
    "arabic": "وَلِلَّهِ الْعِزَّةُ وَلِرَسُولِهِ وَلِلْمُؤْمِنِينَ وَلَٰكِنَّ الْمُنَافِقِينَ لَا يَعْلَمُونَ",
    "urdu": "اور عزت تو اللہ ہی کے لیے ہے اور اس کے رسول کے لیے اور مومنوں کے لیے لیکن منافق نہیں جانتے۔",
    "english": "And honor belongs to Allah and to His Messenger and to the believers, but the hypocrites do not know.",
    "reference": "Surah Al-Munafiqun 63:8"
  },
  {
    "arabic": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَكُونُوا مَعَ الصَّادِقِينَ",
    "urdu": "اے ایمان والو! اللہ سے ڈرو اور سچے لوگوں کے ساتھ رہو۔",
    "english": "O you who have believed, fear Allah and be with those who are true.",
    "reference": "Surah At-Tawbah 9:119"
  },
  {
    "arabic": "وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ",
    "urdu": "اور میں نے جنوں اور انسانوں کو صرف اپنی عبادت کے لیے پیدا کیا ہے۔",
    "english": "And I did not create the jinn and mankind except to worship Me.",
    "reference": "Surah Adh-Dhariyat 51:56"
  },
  {
    "arabic": "وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ",
    "urdu": "اور ایک دوسرے کو حق کی وصیت کرتے رہے اور صبر کی وصیت کرتے رہے۔",
    "english": "And they enjoin what is right and forbid what is wrong and are patient.",
    "reference": "Surah Al-Asr 103:3"
  },
  {
    "arabic": "وَذَكِّرْ فَإِنَّ الذِّكْرَىٰ تَنفَعُ الْمُؤْمِنِينَ",
    "urdu": "اور نصیحت کرتے رہیں کیونکہ نصیحت مومنوں کو فائدہ پہنچاتی ہے۔",
    "english": "And remind, for indeed, the reminder benefits the believers.",
    "reference": "Surah Adh-Dhariyat 51:55"
  },
  {
    "arabic": "وَلَا تَسْتَوِي الْحَسَنَةُ وَلَا السَّيِّئَةُ ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ فَإِذَا الَّذِي بَيْنَكَ وَبَيْنَهُ عَدَاوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ",
    "urdu": "اور نیکی اور بدی برابر نہیں ہو سکتی، تم برائی کو اچھائی سے دفع کرو، پھر وہی جس کے اور تمہارے درمیان دشمنی تھی گویا وہ تمہارا گرم جوش دوست بن جائے گا۔",
    "english": "And not equal are the good deed and the bad. Repel evil by that which is better; and thereupon the one whom between you and him is enmity will become as though he was a devoted friend.",
    "reference": "Surah Fussilat 41:34"
  },
  {
    "arabic": "وَمَا تَفْعَلُوا مِنْ خَيْرٍ يَعْلَمْهُ اللَّهُ",
    "urdu": "اور تم جو بھی نیکی کرو گے اللہ اسے جانتا ہے۔",
    "english": "And whatever good you do - Allah knows it.",
    "reference": "Surah Al-Baqarah 2:197"
  },
  {
    "arabic": "وَأَنفِقُوا فِي سَبِيلِ اللَّهِ وَلَا تُلْقُوا بِأَيْدِيكُمْ إِلَى التَّهْلُكَةِ وَأَحْسِنُوا إِنَّ اللَّهَ يُحِبُّ الْمُحْسِنِينَ",
    "urdu": "اور اللہ کی راہ میں خرچ کرو اور اپنے آپ کو ہلاکت میں نہ ڈالو اور احسان کرو، بے شک اللہ احسان کرنے والوں سے محبت کرتا ہے۔",
    "english": "And spend in the way of Allah and do not throw yourselves with your own hands into destruction. And do good; indeed, Allah loves the doers of good.",
    "reference": "Surah Al-Baqarah 2:195"
  },
  {
    "arabic": "إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ فَأَصْلِحُوا بَيْنَ أَخَوَيْكُمْ وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُرْحَمُونَ",
    "urdu": "مومن تو آپس میں بھائی بھائی ہیں، پس اپنے دو بھائیوں کے درمیان صلح کرا دو اور اللہ سے ڈرو تاکہ تم پر رحم کیا جائے۔",
    "english": "The believers are but brothers, so make settlement between your brothers. And fear Allah that you may receive mercy.",
    "reference": "Surah Al-Hujurat 49:10"
  },
  {
    "arabic": "وَلَا تَمُدَّنَّ عَيْنَيْكَ إِلَىٰ مَا مَتَّعْنَا بِهِ أَزْوَاجًا مِّنْهُمْ زَهْرَةَ الْحَيَاةِ الدُّنْيَا لِنَفْتِنَهُمْ فِيهِ وَرِزْقُ رَبِّكَ خَيْرٌ وَأَبْقَىٰ",
    "urdu": "اور جو کچھ ہم نے ان میں سے بعض گروہوں کو دنیوی زندگی کی زینت کے طور پر دیا ہے اس کی طرف مت دیکھو، تاکہ ہم انہیں اس میں آزمائیں، اور تیرے رب کا رزق بہتر اور پائیدار ہے۔",
    "english": "And do not extend your eyes toward that by which We have given enjoyment to some groups of them, the splendor of worldly life by which We test them. And the provision of your Lord is better and more enduring.",
    "reference": "Surah Ta-Ha 20:131"
  },
  {
    "arabic": "وَمَا مِن دَابَّةٍ فِي الْأَرْضِ إِلَّا عَلَى اللَّهِ رِزْقُهَا",
    "urdu": "اور زمین پر چلنے والا کوئی جاندار ایسا نہیں جس کا رزق اللہ کے ذمہ نہ ہو۔",
    "english": "And there is no creature on earth but that upon Allah is its provision.",
    "reference": "Surah Hud 11:6"
  },
  {
    "arabic": "وَمَا أَنفَقْتُم مِّن شَيْءٍ فَهُوَ يُخْلِفُهُ وَهُوَ خَيْرُ الرَّازِقِينَ",
    "urdu": "اور تم جو کچھ بھی خرچ کرو گے وہ اس کا بدلہ دے گا اور وہ سب سے بہتر رزق دینے والا ہے۔",
    "english": "And whatever you spend of anything, He will compensate it; and He is the best of providers.",
    "reference": "Surah Saba 34:39"
  },
  {
    "arabic": "وَلَا تَقْتُلُوا أَوْلَادَكُمْ خَشْيَةَ إِمْلَاقٍ نَّحْنُ نَرْزُقُهُمْ وَإِيَّاكُمْ إِنَّ قَتْلَهُمْ كَانَ خِطْئًا كَبِيرًا",
    "urdu": "اور اپنی اولاد کو مفلسی کے ڈر سے قتل نہ کرو، ہم انہیں بھی رزق دیں گے اور تمہیں بھی، بے شک ان کا قتل بہت بڑا گناہ ہے۔",
    "english": "And do not kill your children for fear of poverty. We provide for them and for you. Indeed, their killing is ever a great sin.",
    "reference": "Surah Al-Isra 17:31"
  },
  {
    "arabic": "وَمَن يَتَّقِ اللَّهَ يَجْعَل لَّهُ مِنْ أَمْرِهِ يُسْرًا",
    "urdu": "اور جو اللہ سے ڈرتا ہے اللہ اس کے لیے اس کے کام میں آسانی پیدا کر دیتا ہے۔",
    "english": "And whoever fears Allah - He will make for him of his matter ease.",
    "reference": "Surah At-Talaq 65:4"
  },
  {
    "arabic": "وَلَا تَقْتُلُوا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ",
    "urdu": "اور جس جان کو اللہ نے حرام کیا ہے اسے ناحق قتل نہ کرو۔",
    "english": "And do not kill the soul which Allah has forbidden, except by right.",
    "reference": "Surah Al-Isra 17:33"
  },
  {
    "arabic": "وَلَا تَقْفُ مَا لَيْسَ لَكَ بِهِ عِلْمٌ إِنَّ السَّمْعَ وَالْبَصَرَ وَالْفُؤَادَ كُلُّ أُولَٰئِكَ كَانَ عَنْهُ مَسْئُولًا",
    "urdu": "اور جس چیز کا تمہیں علم نہ ہو اس کے پیچھے نہ پڑو، بے شک کان، آنکھ اور دل، ان سب سے پوچھ گچھ ہوگی۔",
    "english": "And do not pursue that of which you have no knowledge. Indeed, the hearing, the sight and the heart - about all those one will be questioned.",
    "reference": "Surah Al-Isra 17:36"
  },
  {
    "arabic": "وَاعْبُدُوا اللَّهَ وَلَا تُشْرِكُوا بِهِ شَيْئًا وَبِالْوَالِدَيْنِ إِحْسَانًا",
    "urdu": "اور اللہ کی عبادت کرو اور اس کے ساتھ کسی کو شریک نہ ٹھہراؤ اور والدین کے ساتھ احسان کرو۔",
    "english": "Worship Allah and associate nothing with Him, and to parents do good.",
    "reference": "Surah An-Nisa 4:36"
  }
]
