[
  {
    "arabic": "إِنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى",
    "urdu": "اعمال کا دارومدار نیتوں پر ہے، اور ہر آدمی کو وہی ملے گا جس کی اس نے نیت کی۔",
    "english": "Actions are judged by intentions, and everyone will get what was intended.",
    "reference": "Sahih Bukhari - Hadith 1"
  },
  {
    "arabic": "الْمُسْلِمُ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ",
    "urdu": "مسلمان وہ ہے جس کی زبان اور ہاتھ سے دوسرے مسلمان محفوظ رہیں۔",
    "english": "A Muslim is one from whose tongue and hand the Muslims are safe.",
    "reference": "Sahih Bukhari - Hadith 10"
  },
  {
    "arabic": "لاَ يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ",
    "urdu": "تم میں سے کوئی شخص اس وقت تک مومن نہیں ہو سکتا جب تک اپنے بھائی کے لیے وہی پسند نہ کرے جو اپنے لیے پسند کرتا ہے۔",
    "english": "None of you will have faith until he loves for his brother what he loves for himself.",
    "reference": "Sahih Bukhari - Hadith 13"
  },
  {
    "arabic": "إِذَا لَمْ تَسْتَحِ فَاصْنَعْ مَا شِئْتَ",
    "urdu": "جب تمہیں شرم نہ آئے تو جو چاہو کرو۔",
    "english": "If you feel no shame, then do as you wish.",
    "reference": "Sahih Bukhari - Hadith 3483"
  },
  {
    "arabic": "اتَّقِ اللَّهَ حَيْثُمَا كُنْتَ وَأَتْبِعِ السَّيِّئَةَ الْحَسَنَةَ تَمْحُهَا وَخَالِقِ النَّاسَ بِخُلُقٍ حَسَنٍ",
    "urdu": "جہاں کہیں بھی ہو اللہ سے ڈرتے رہو، برائی کے بعد نیکی کر لو وہ اسے مٹا دے گی، اور لوگوں کے ساتھ اچھے اخلاق سے پیش آؤ۔",
    "english": "Fear Allah wherever you are, follow up a bad deed with a good deed to erase it, and treat people with good character.",
    "reference": "Jami` at-Tirmidhi - Hadith 1987"
  },
  {
    "arabic": "مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ",
    "urdu": "جو شخص اللہ اور آخرت کے دن پر ایمان رکھتا ہے اسے چاہیے کہ اچھی بات کہے یا خاموش رہے۔",
    "english": "Whoever believes in Allah and the Last Day should speak good or remain silent.",
    "reference": "Sahih Bukhari - Hadith 6018"
  },
  {
    "arabic": "الرَّاحِمُونَ يَرْحَمُهُمُ الرَّحْمَٰنُ ارْحَمُوا مَنْ فِي الْأَرْضِ يَرْحَمْكُمْ مَنْ فِي السَّمَاءِ",
    "urdu": "رحم کرنے والوں پر رحمان رحم کرتا ہے، تم زمین والوں پر رحم کرو آسمان والا تم پر رحم کرے گا۔",
    "english": "The merciful will be shown mercy by the Most Merciful. Be merciful to those on the earth and the One above the heavens will have mercy upon you.",
    "reference": "Jami` at-Tirmidhi - Hadith 1924"
  },
  {
    "arabic": "الْبِرُّ حُسْنُ الْخُلُقِ",
    "urdu": "نیکی اچھے اخلاق کا نام ہے۔",
    "english": "Righteousness is good character.",
    "reference": "Sahih Muslim - Hadith 2553"
  },
  {
    "arabic": "لَا تَحْقِرَنَّ مِنَ الْمَعْرُوفِ شَيْئًا وَلَوْ أَنْ تَلْقَى أَخَاكَ بِوَجْهٍ طَلْقٍ",
    "urdu": "کسی بھی نیکی کو حقیر مت سمجھو، چاہے تمہارا اپنے بھائی سے خوشی سے ملنا ہی کیوں نہ ہو۔",
    "english": "Do not consider any act of kindness insignificant, even meeting your brother with a cheerful face.",
    "reference": "Sahih Muslim - Hadith 2626"
  },
  {
    "arabic": "الْمُؤْمِنُ لِلْمُؤْمِنِ كَالْبُنْيَانِ يَشُدُّ بَعْضُهُ بَعْضًا",
    "urdu": "مومن دوسرے مومن کے لیے ایک عمارت کی مانند ہے جس کا ایک حصہ دوسرے حصے کو مضبوط کرتا ہے۔",
    "english": "A believer to another believer is like a building whose different parts enforce each other.",
    "reference": "Sahih Bukhari - Hadith 2446"
  },
  {
    "arabic": "مَنْ نَفَّسَ عَنْ مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ الدُّنْيَا نَفَّسَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ",
    "urdu": "جو شخص کسی مومن کی دنیا کی تکلیفوں میں سے کوئی تکلیف دور کرے گا، اللہ قیامت کے دن اس کی تکلیفوں میں سے کوئی تکلیف دور کرے گا۔",
    "english": "Whoever relieves a believer's distress of the distressful aspects of this world, Allah will rescue him from a difficulty of the difficulties of the Hereafter.",
    "reference": "Sahih Muslim - Hadith 2699"
  },
  {
    "arabic": "إِنَّ اللَّهَ لَا يَنْظُرُ إِلَى صُوَرِكُمْ وَأَمْوَالِكُمْ وَلَكِنْ يَنْظُرُ إِلَى قُلُوبِكُمْ وَأَعْمَالِكُمْ",
    "urdu": "بے شک اللہ تمہاری صورتیں اور تمہارے مال نہیں دیکھتا، بلکہ وہ تمہارے دلوں اور تمہارے اعمال کو دیکھتا ہے۔",
    "english": "Indeed, Allah does not look at your appearances or wealth, but rather He looks at your hearts and your deeds.",
    "reference": "Sahih Muslim - Hadith 2564"
  },
  {
    "arabic": "الْمُسْلِمُ أَخُو الْمُسْلِمِ لَا يَظْلِمُهُ وَلَا يَخْذُلُهُ",
    "urdu": "مسلمان مسلمان کا بھائی ہے، نہ اس پر ظلم کرتا ہے اور نہ اسے رسوا کرتا ہے۔",
    "english": "A Muslim is a brother of another Muslim, he neither oppresses him nor humiliates him.",
    "reference": "Sahih Bukhari - Hadith 2442"
  },
  {
    "arabic": "مَا زَالَ جِبْرِيلُ يُوصِينِي بِالْجَارِ حَتَّى ظَنَنْتُ أَنَّهُ سَيُوَرِّثُهُ",
    "urdu": "جبرائیل مجھے پڑوسی کے بارے میں اتنی وصیت کرتے رہے کہ میں نے سمجھا کہ وہ اسے وارث بنا دیں گے۔",
    "english": "Jibril kept recommending me about treating the neighbors kindly so much so that I thought he would make them heirs.",
    "reference": "Sahih Bukhari - Hadith 6014"
  },
  {
    "arabic": "لَيْسَ الْمُؤْمِنُ بِالطَّعَّانِ وَلَا اللَّعَّانِ وَلَا الْفَاحِشِ وَلَا الْبَذِيءِ",
    "urdu": "مومن طعنہ زن نہیں ہوتا، نہ لعنت کرنے والا ہوتا ہے، نہ فحش گو ہوتا ہے اور نہ بدزبان ہوتا ہے۔",
    "english": "A believer is not one who taunts others, nor one who curses others, nor one who is obscene, nor one who is abusive.",
    "reference": "Jami` at-Tirmidhi - Hadith 1977"
  },
  {
    "arabic": "إِنَّ مِنْ أَحَبِّكُمْ إِلَيَّ وَأَقْرَبِكُمْ مِنِّي مَجْلِسًا يَوْمَ الْقِيَامَةِ أَحَاسِنَكُمْ أَخْلَاقًا",
    "urdu": "قیامت کے دن تم میں سے میرے نزدیک سب سے زیادہ محبوب اور سب سے قریب وہ ہوگا جو تم میں اخلاق میں سب سے اچھا ہوگا۔",
    "english": "The most beloved of you to me and the nearest to me in the Hereafter are those with the best character.",
    "reference": "Jami` at-Tirmidhi - Hadith 2018"
  },
  {
    "arabic": "الْكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ",
    "urdu": "اچھی بات کہنا بھی صدقہ ہے۔",
    "english": "A good word is charity.",
    "reference": "Sahih Bukhari - Hadith 2989"
  },
  {
    "arabic": "تَبَسُّمُكَ فِي وَجْهِ أَخِيكَ لَكَ صَدَقَةٌ",
    "urdu": "اپنے بھائی کے سامنے مسکرانا بھی صدقہ ہے۔",
    "english": "Your smiling in the face of your brother is charity.",
    "reference": "Jami` at-Tirmidhi - Hadith 1956"
  },
  {
    "arabic": "مَا مِنْ مُسْلِمٍ يَغْرِسُ غَرْسًا أَوْ يَزْرَعُ زَرْعًا فَيَأْكُلُ مِنْهُ طَيْرٌ أَوْ إِنْسَانٌ أَوْ بَهِيمَةٌ إِلَّا كَانَ لَهُ بِهِ صَدَقَةٌ",
    "urdu": "جو مسلمان کوئی درخت لگائے یا کھیتی بوئے پھر اس میں سے کوئی پرندہ یا انسان یا جانور کھائے تو وہ اس کے لیے صدقہ ہو جاتا ہے۔",
    "english": "There is no Muslim who plants a tree or sows a crop and a bird, or a person or an animal eats from it except that it is regarded as a charity for him.",
    "reference": "Sahih Bukhari - Hadith 2320"
  },
  {
    "arabic": "إِنَّ اللَّهَ طَيِّبٌ لَا يَقْبَلُ إِلَّا طَيِّبًا",
    "urdu": "بے شک اللہ پاک ہے اور پاکیزہ چیز ہی قبول کرتا ہے۔",
    "english": "Indeed, Allah is pure and He accepts only what is pure.",
    "reference": "Sahih Muslim - Hadith 1015"
  },
  {
    "arabic": "الدُّنْيَا مَزْرَعَةُ الْآخِرَةِ",
    "urdu": "دنیا آخرت کی کھیتی ہے۔",
    "english": "The world is the cultivation of the Hereafter.",
    "reference": "Musnad Ahmad - Hadith 17339"
  },
  {
    "arabic": "مَنْ سَلَكَ طَرِيقًا يَلْتَمِسُ فِيهِ عِلْمًا سَهَّلَ اللَّهُ لَهُ بِهِ طَرِيقًا إِلَى الْجَنَّةِ",
    "urdu": "جو شخص علم حاصل کرنے کے لیے کسی راستے پر چلتا ہے اللہ اس کے لیے جنت کا راستہ آسان کر دیتا ہے۔",
    "english": "Whoever travels a path in search of knowledge, Allah will make easy for him a path to Paradise.",
    "reference": "Sahih Muslim - Hadith 2699"
  },
  {
    "arabic": "طَلَبُ الْعِلْمِ فَرِيضَةٌ عَلَى كُلِّ مُسْلِمٍ",
    "urdu": "علم حاصل کرنا ہر مسلمان پر فرض ہے۔",
    "english": "Seeking knowledge is obligatory upon every Muslim.",
    "reference": "Sunan Ibn Majah - Hadith 224"
  },
  {
    "arabic": "خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ",
    "urdu": "تم میں سے بہترین وہ ہے جو قرآن سیکھے اور سکھائے۔",
    "english": "The best among you are those who learn the Quran and teach it.",
    "reference": "Sahih Bukhari - Hadith 4739"
  },
  {
    "arabic": "إِذَا مَاتَ الْإِنْسَانُ انْقَطَعَ عَنْهُ عَمَلُهُ إِلَّا مِنْ ثَلَاثَةٍ إِلَّا مِنْ صَدَقَةٍ جَارِيَةٍ أَوْ عِلْمٍ يُنْتَفَعُ بِهِ أَوْ وَلَدٍ صَالِحٍ يَدْعُو لَهُ",
    "urdu": "جب انسان مر جاتا ہے تو اس کا عمل منقطع ہو جاتا ہے سوائے تین چیزوں کے: صدقہ جاریہ، یا علم جس سے فائدہ اٹھایا جائے، یا نیک اولاد جو اس کے لیے دعا کرے۔",
    "english": "When a man dies, his deeds come to an end except for three things: ongoing charity, knowledge which is beneficial, or a virtuous descendant who prays for him.",
    "reference": "Sahih Muslim - Hadith 1631"
  },
  {
    "arabic": "مَا مِنْ مُسْلِمٍ يُصِيبُهُ أَذًى مِنْ مَرَضٍ فَمَا سِوَاهُ إِلَّا حَطَّ اللَّهُ بِهِ سَيِّئَاتِهِ كَمَا تَحُطُّ الشَّجَرَةُ وَرَقَهَا",
    "urdu": "جو مسلمان کسی بیماری یا کسی اور تکلیف میں مبتلا ہوتا ہے تو اللہ اس کے گناہوں کو اس طرح جھاڑ دیتا ہے جیسے درخت اپنے پتوں کو جھاڑ دیتا ہے۔",
    "english": "No Muslim is afflicted with any harm, whether a thorn or more than that, except that Allah will expiate his sins because of it, as leaves fall from a tree.",
    "reference": "Sahih Bukhari - Hadith 5641"
  },
  {
    "arabic": "مَنْ كَانَ يُرِيدُ الْعَافِيَةَ فَلْيَلْزَمِ الصَّمْتَ",
    "urdu": "جو شخص عافیت چاہتا ہے اسے چاہیے کہ خاموشی اختیار کرے۔",
    "english": "Whoever desires safety should remain silent.",
    "reference": "Al-Mu'jam al"
  },
  {
    "arabic": "مَنْ لَا يَرْحَمْ لَا يُرْحَمْ",
    "urdu": "جو رحم نہیں کرتا، اس پر رحم نہیں کیا جائے گا۔",
    "english": "He who does not show mercy will not be shown mercy.",
    "reference": "Sahih Bukhari - Hadith 6013"
  },
  {
    "arabic": "الدُّعَاءُ هُوَ الْعِبَادَةُ",
    "urdu": "دعا ہی عبادت ہے۔",
    "english": "Supplication is worship.",
    "reference": "Jami` at-Tirmidhi - Hadith 2969"
  },
  {
    "arabic": "الْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى",
    "urdu": "اوپر والا ہاتھ (دینے والا) نیچے والے ہاتھ (لینے والے) سے بہتر ہے۔",
    "english": "The upper hand (giving) is better than the lower hand (receiving).",
    "reference": "Sahih Bukhari - Hadith 1429"
  },
  {
    "arabic": "إِنَّمَا الْعِلْمُ بِالتَّعَلُّمِ",
    "urdu": "علم سیکھنے ہی سے حاصل ہوتا ہے۔",
    "english": "Knowledge is gained through learning.",
    "reference": "Sunan Ibn Majah - Hadith 219"
  }
]
